{
    "backend": "tensorflow",
    "class_name": "Sequential",
    "config": {
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        15,
                        28
                    ],
                    "dtype": "float32",
                    "name": "input_1",
                    "ragged": false,
                    "sparse": false
                }
            },
            {
                "class_name": "GRU",
                "config": {
                    "activation": "tanh",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dropout": 0.0,
                    "dtype": "float32",
                    "go_backwards": false,
                    "implementation": 2,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "gru",
                    "recurrent_activation": "sigmoid",
                    "recurrent_constraint": null,
                    "recurrent_dropout": 0.0,
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "recurrent_regularizer": null,
                    "reset_after": true,
                    "return_sequences": false,
                    "return_state": false,
                    "stateful": false,
                    "time_major": false,
                    "trainable": true,
                    "units": 28,
                    "unroll": false,
                    "use_bias": true
                }
            }
        ],
        "name": "sequential"
    },
    "keras_version": "2.4.0"
}